Documents/УслугиСобственнымПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УслугиСобственнымПодразделениям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КорректировкиНезавершенноеПроизводствоНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиСтроительствоОбъектовОсновныхСредствНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиБракВПроизводствеНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиЗатратыНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиПартииТоваровНалоговыйУчет</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ДокументыТребующиеДопроведения</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатратРегл</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизацииПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначениеДоходовИЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УслугиСобственнымПодразделениям/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		// Это существующий документ. 
		// Проверим, что его можно менять.
		
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(РеквизитФормыВЗначение("Объект"), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// СОХРАНЕНИЕ И ВОССТАНОВЛЕНИЕ ДАННЫХ ИЗ НАСТРОЕК

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ХранилищаНастроек.ДанныеФорм.ДобавитьДополнительныеДанныеВНастройку(Объект, Настройки, Документы.УслугиСобственнымПодразделениям.СтруктураДополнительныхДанныхФормы());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ХранилищаНастроек.ДанныеФорм.ЗаполнитьОбъектДополнительнымиДанными(Объект, Настройки, Документы.УслугиСобственнымПодразделениям.СтруктураДополнительныхДанныхФормы());
	Модифицированность = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПОВТОРЯЮЩИЕСЯ ДЕЙСТВИЯ ПРИ ИЗМЕНЕНИИ РАЗНЫХ РЕКВИЗИТОВ

&НаКлиенте
Процедура ОповеститьНеЗаданыПараметрыУчетаНоменклатуры(ЗначенияДляЗаполнения)
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначенияДляЗаполнения.Свойство("Подразделение") Тогда
		// Подразделение заполняется из параметров учета номенклатуры
		Возврат;
	КонецЕсли;
	
	// Оповестим о том, что не заполнены параметры учета номенклатуры
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ТекстОповещения = Нстр("ru = 'Данные об исполнителе не изменены'");
	Иначе
		ТекстОповещения = Нстр("ru = 'Данные об исполнителе не заполнены'");
	КонецЕсли;
	
	Пояснение = Нстр("ru = 'Не выполнена настройка параметров учета для услуги &Услуга'");
	Пояснение = СтрЗаменить(Пояснение, "&Услуга", "" + Объект.Номенклатура);
	
	ПоказатьОповещениеПользователя(ТекстОповещения, , Пояснение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ ДАННЫХ В ШАПКЕ

&НаСервереБезКонтекста
Функция ПараметрыУчетаНоменклатуры(ДанныеДляЗаполнения)
	
	Возврат Документы.УслугиСобственнымПодразделениям.ПараметрыУчетаНоменклатуры(ДанныеДляЗаполнения);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИзменениеОрганизацииСервер(ДанныеДляЗаполнения)
	
	ЗначенияДляЗаполнения = Новый Структура;
	
	Если ЗначениеЗаполнено(ДанныеДляЗаполнения.Номенклатура) Тогда
		
		ЗначенияДляЗаполнения = ПараметрыУчетаНоменклатуры(ДанныеДляЗаполнения);
		
	Иначе // Номенклатура не заполнена
		
		// Заполняем только подразделение организации
		ПодразделениеОрганизации = РаботаСДиалогамиСервер.ПодразделениеОрганизации(ДанныеДляЗаполнения.Подразделение, ДанныеДляЗаполнения.Организация);
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			ЗначенияДляЗаполнения.Вставить("ПодразделениеОрганизации", ПодразделениеОрганизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначенияДляЗаполнения;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем данные с сервера
	ДанныеОбменаССервером = Новый Структура("Дата, Организация, Номенклатура");
	ЗаполнитьЗначенияСвойств(ДанныеОбменаССервером, Объект);
	
	ЗначенияДляЗаполнения = ПараметрыУчетаНоменклатуры(ДанныеОбменаССервером);
	ЗаполнитьЗначенияСвойств(Объект,   ЗначенияДляЗаполнения);
	
	// Оповещаем, если не заданы параметры учета номенклатуры
	ОповеститьНеЗаданыПараметрыУчетаНоменклатуры(ЗначенияДляЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Получаем данные с сервера
	ДанныеОбменаССервером = Новый Структура("Дата, Организация, Подразделение, Номенклатура");
	ЗаполнитьЗначенияСвойств(ДанныеОбменаССервером, Объект);
	
	ЗначенияДляЗаполнения = ИзменениеОрганизацииСервер(ДанныеОбменаССервером);
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияДляЗаполнения);
	
	// Оповещаем, если не заданы параметры учета номенклатуры
	ОповеститьНеЗаданыПараметрыУчетаНоменклатуры(ЗначенияДляЗаполнения);
		
	Если НЕ ПустаяСтрока(Объект.Номер) Тогда
		ПрефиксацияОбъектовСобытия.ОчиститьНомерОбъекта(Объект.Номер, Объект.Организация);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		// Могли поменяться параметры учета

		ДанныеДляОбменаССервером = Новый Структура("Номенклатура, Дата, Организация");
		ЗаполнитьЗначенияСвойств(ДанныеДляОбменаССервером, Объект);

		ЗначенияДляЗаполнения = ПараметрыУчетаНоменклатуры(ДанныеДляОбменаССервером);

		ОповеститьНеЗаданыПараметрыУчетаНоменклатуры(ЗначенияДляЗаполнения);

		// Заполним шапку
		ЗаполнитьЗначенияСвойств(Объект, ЗначенияДляЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	РаботаСДиалогамиКлиент.ЗаполнитьПодразделениеОрганизации(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНалоговоеНазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Затраты.ТекущиеДанные;
	ГруппаНалоговыхНазначений = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СтрокаТабличнойЧасти.Счет,,,,Объект.Дата);
	РаботаСДиалогамиКлиент.НачалоВыбораЗначенияНалоговоеНазначениеУП(Элемент, СтандартнаяОбработка, ГруппаНалоговыхНазначений);
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНалоговоеНазначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Затраты.ТекущиеДанные;
	ГруппаНалоговыхНазначений = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СтрокаТабличнойЧасти.Счет,,,,Объект.Дата);
	РаботаСДиалогамиКлиент.АвтоПодборТекстаНалоговоеНазначениеУП(Текст, ДанныеВыбора, СтандартнаяОбработка, ГруппаНалоговыхНазначений);
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНалоговоеНазначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Затраты.ТекущиеДанные;
	ГруппаНалоговыхНазначений = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СтрокаТабличнойЧасти.Счет,,,,Объект.Дата);
	РаботаСДиалогамиКлиент.ОкончаниеВводаТекстаНалоговоеНазначениеУП(Текст, ДанныеВыбора, СтандартнаяОбработка, ГруппаНалоговыхНазначений);
КонецПроцедуры
